from stepik_1_12_6 import name_of_programmers

assert name_of_programmers(11) == "11 программистов", "При входном значении 11, должно быть '11 программистов'"
assert name_of_programmers(12) == "12 программистов", "При входном значении 12, должно быть '12 программистов'"
assert name_of_programmers(13) == "13 программистов", "При входном значении 13, должно быть '13 программистов'"
assert name_of_programmers(14) == "14 программистов", "При входном значении 14, должно быть '14 программистов'"
assert name_of_programmers(16) == "16 программистов", "При входном значении 16, должно быть '16 программистов'"
assert name_of_programmers(912) == "912 программистов", "При входном значении 912, должно быть '912 программистов'"
assert name_of_programmers(614) == "614 программистов", "При входном значении 614, должно быть '614 программистов'"

assert name_of_programmers(5) == "5 программистов", "При входном значении 5, должно быть '5 программистов'"
assert name_of_programmers(20) == "20 программистов", "При входном значении 20, должно быть '20 программистов'"
assert name_of_programmers(805) == "805 программистов", "При входном значении 805, должно быть '805 программистов'"
assert name_of_programmers(200) == "200 программистов", "При входном значении 200, должно быть '200 программистов'"
assert name_of_programmers(0) == "0 программистов", "При входном значении 0, должно быть '0 программистов'"

assert name_of_programmers(1) == "1 программист", "При входном значении 1, должно быть '1 программист'"
assert name_of_programmers(102) == "102 программиста", "При входном значении 151, должно быть '151 программист'"
assert name_of_programmers(151) == "151 программист", "При входном значении 151, должно быть '151 программист'"

assert name_of_programmers(2) == "2 программиста", "При входном значении 2, должно быть '2 программиста'"
assert name_of_programmers(3) == "3 программиста", "При входном значении 3, должно быть '3 программиста'"
assert name_of_programmers(4) == "4 программиста", "При входном значении 4, должно быть '4 программиста'"
assert name_of_programmers(153) == "153 программиста", "При входном значении 153, должно быть '153 программиста'"
